_posts/2018-11-26-ReadAndWriteFiles.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 文本数据（csv,txt）</a>
<ul>
<li><a href="#sec-1-1">1.1. Requirements</a></li>
</ul>
</li>
<li><a href="#sec-2">2. JSON和Excel数据</a></li>
<li><a href="#sec-3">3. 数据库的读取和存储</a></li>
</ul>
</div>
</div>
---
layout: post
title: "Notes --- Read and Write Files"
permalink: /:title/
tagxs: [Data Visualization]
---
<head>
   <meta http-equiv="Content-Type" content="text/html;charset=utf-8">
</head>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 文本数据（csv,txt）</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html">read_csv()</a> : 加载带分隔符的数据，默认分隔符为逗号
</li>
<li><a href="https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_table.html">read_table()</a> : 加载带分割的数据，默认分隔符为制表符
</li>
</ul>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Requirements</h3>
<div class="outline-text-3" id="text-1-1">
<p>
安装Pymysql包： conda install pymysql
</p>

<div class="org-src-container">

<pre class="src src-js"><span class="linenr">1: </span>from PIL <span style="color: #fff59d;">import</span> Image
<span class="linenr">2: </span><span style="color: #fff59d;">import</span> numpy as np
<span class="linenr">3: </span>im=np.array(Image.open(<span style="color: #9ccc65;">'/path/of/image'</span>))
<span class="linenr">4: </span>print(im.shape,im.dtype)
<span class="linenr">5: </span>
<span class="linenr">6: </span>b=[255,255,255]-im  #&#28784;&#24230;&#21464;&#21270;
<span class="linenr">7: </span>new_im=Image.fromarray(b.astype(<span style="color: #9ccc65;">'uint8'</span>))
<span class="linenr">8: </span>new_im.save(<span style="color: #9ccc65;">'/path/of/changed/image'</span>)
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> JSON和Excel数据</h2>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 数据库的读取和存储</h2>
</div>
